function [ h, r ] = TestChannel(T, Fd, L, MaxN)
%产生测试的参数化多径瑞利信道
%   ================================================================================
%   T:  采样间隔（秒），对应OFDM的采样间隔。OFDM的符号时间长度 = T * (ofdm.N + ofdm.GI)
%   Fd: 多普勒频移（Hz）
%   L:  多径的径数
%   MaxN:   最大多径延迟
%   -------------------------
%   h:  输出的信道
%   r:  延时参数
%   =========================
%   相关的多径参数将会随机产生
%   ================================================================================

p = randperm(MaxN) - 1;
r = p(1: L);
r = sort(r);
tau = r .* T;
pdb = ones(1, L);

h = rayleighchan(T, Fd, tau, pdb);
end

